app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY title
---
  def index
	@products = Product.find_products_for_sale

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def add_to_cart
    product = Product.find(params[:id])